20250707123015-lesson_6_get_feedback.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-31 Sat 14:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lesson 6 Get Feedback</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Lesson 6 Get Feedback</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga31b6f3">1. 6.1 Getting customer feedback</a>
<ul>
<li><a href="#org015ef29">1.1. Connect to the customer:</a></li>
</ul>
</li>
<li><a href="#orgc008b99">2. 6.2 Demonstrating value with Iteration Review</a></li>
<li><a href="#orgfa9a907">3. 6.3 System Demo</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga31b6f3" class="outline-2">
<h2 id="orga31b6f3"><span class="section-number-2">1.</span> 6.1 Getting customer feedback</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org015ef29" class="outline-3">
<h3 id="org015ef29"><span class="section-number-3">1.1.</span> Connect to the customer:</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Product roles as a proxy (Understand customer's needs)</li>
<li>Gemba walks (observing customers in day-to-day using solutions, obeserving problem spaces)</li>
<li>Empathy mapping (Ability to put aside our preconceived ideas and develop solutions from the perspective of our customers)
Tool that helps teams develop deep, shared understanding and empathy for others.
Empathy map can be used to design better experiences and value streams.</li>
<li>System Demo</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc008b99" class="outline-2">
<h2 id="orgc008b99"><span class="section-number-2">2.</span> 6.2 Demonstrating value with Iteration Review</h2>
<div class="outline-text-2" id="text-2">
<p>
Demonstrating a working tested team increment
Iteration review provides true measure of progress by showing working software functionality and business outcome progression.
</p>

<ul class="org-ul">
<li>Preparation starts with planning</li>
<li>Teams demonstrate every Store, spike, refactor and NFR</li>
<li>Attended by the team and stakeholders</li>
</ul>

<p>
1 - 2 hours
</p>

<p>
Two views from the iteration review based on a working system:
</p>
<ul class="org-ul">
<li>How did we do in the iteration?</li>
<li>How are we doing in the PI?</li>
</ul>

<p>
Cumulative Flow Diagrams (CFDs)
</p>
</div>
</div>

<div id="outline-container-orgfa9a907" class="outline-2">
<h2 id="orgfa9a907"><span class="section-number-2">3.</span> 6.3 System Demo</h2>
<div class="outline-text-2" id="text-3">
<p>
Base milestones on objective evaluation of working systems
</p>

<ul class="org-ul">
<li>Demos happen after iteration review and may lag by one iteration at most.</li>
<li>Features are functionally complete.</li>
<li>New features work together and with existing functionality.</li>
<li>Demos happen from a staging enviornment that resembles production as much as possible.</li>
</ul>

<p>
Demonstrates value at each iteration
</p>
<ul class="org-ul">
<li>System demo tests and evaluates the full solution in a production-like context, often through staging, to receive feedback from stakeholders.</li>
</ul>
</div>
</div>
</div>
</body>
</html>
